insert into education (name) 
values 
    ('Высшее'), -- 1
    ('Среднее'); -- 2

insert into departments (name) 
values 
    ('Административно-управленческий персонал'), -- 1
    ('Бухгалтерия'), -- 2
    ('Отдел кадров'), -- 3
    ('Учебная часть'), -- 4
    ('Штат преподавателей'); -- 5


insert into positions (name, salary) 
values 
    ('зам дир по вос  раб ', 32500), -- 1
    ('директор', 42000), -- 2
    ('зам дир по уч работе', 18000), -- 3
    ('зам дир по УПР', 22050), -- 4
    ('заведующий факультет', 26000), -- 5
    ('Гл бух', 33700), -- 6
    ('Кассир', 17000), -- 7
    ('Бух', 22000), -- 8
    ('Ст бух', 26000), -- 9
    ('Нач отд кадров', 12000), -- 10
    ('ст инспекор', 32500), -- 11
    ('Инструктор ВУС', 23000), -- 12
    ('Архивариус', 22000), -- 13
    ('Делопроизводитель', 15000), -- 14
    ('Машинистка', 18000), -- 15
    ('Секретант-референт', 22000), -- 16
    ('Завуч', 28000), -- 17
    ('Основной препод', 24000), -- 18
    ('Совместитель', 19000), -- 19
    ('Секретарь', 14000); -- 20

insert into staffes (seats_count, department_id, position_id)
    values 
        (1, 1, 2),
        (1, 1, 3),
        (1, 1, 4),
        (1, 1, 1),
        (4, 1, 5),
        (1, 2, 6),
        (1, 2, 9),
        (3, 2, 8),
        (1, 2, 7),
        (1, 3, 10),
        (1, 3, 11),
        (1, 3, 12),
        (1, 3, 13),
        (1, 3, 14),
        (1, 3, 15),
        (1, 3, 16),
        (1, 4, 17),
        (1, 4, 20),
        (37, 5, 18),
        (19, 5, 19);

insert into employees (last_name, first_name, sur_name, birth_day, telephon, gender, education_id)
    values 
        ('Фуфаев', 'Ярослав', 'Станиславович', '1990-03-01', '3955889', 'м', 1), -- 1
        ('Акимов', 'Аким', 'Акимович', '1960-02-17', '2354678', 'м', 1), -- 2
        ('Пронин', 'Василий', 'Вадимович', '1975-07-20', '5358946', 'м', 2), -- 3
        ('Петров', 'Петр', 'Петрович', '1982-02-01', '911512', 'м', 1), -- 4
        ('Петренко', 'Петр', 'Иванович', '1982-02-01','911102', 'м', 1), -- 5
        ('Петренко', 'Иванович', 'Иванович', '1982-02-01', '922293', 'м', 1), -- 6
        ('Дубова', 'Галина', 'Ивановна', '1960-02-14', '912558', 'ж', 1), -- 7
        ('Бабичев', 'Евгений', 'Иванович', '1960-06-12', '999192', 'м', 2), -- 8
        ('Нагаев', 'Дмитрий', 'Иванович', '1985-09-20', '119231', 'м', 1), -- 9
        ('Семенова', 'Ольга', 'Евгеньевна', '1960-06-12', '525231', 'ж', 2), -- 10
        ('Сидоров', 'Павел', 'Петрович', '1960-02-07', '119231', 'м', 1), -- 11
        ('Овдиенко', 'Павел', 'Петрович', '1980-02-02', '119231', 'м', 2), -- 12
        ('Кузнецов', 'Василий', 'Петрович', '1950-01-01', '119231', 'м', 1), -- 13
        ('Ильенко', 'Александр', 'Иванович', '1982-01-02', '119231', 'м', 1), -- 14
        ('Ильенко', 'Дмитрий', 'Иванович', '1982-01-02', '119231', 'м', 1); -- 15

insert into appointments (appoint_date, dismissal_date, salary, position_id, department_id, employee_id)
    values 
        ('2002-05-30', null,35620, 1, 1, 1),
        ('2007-11-26', null, 45700, 2, 1, 2),
        ('2003-02-17', null,38000, 3, 1, 3),
        ('2003-02-18', '2019-02-19',20030, 7, 2, 4),
        ('2003-02-18', null,31700, 8, 2, 5),
        ('2003-02-19', null, 39420, 9, 2, 6),
        ('2002-01-01', null, 24000, 13, 3, 7),
        ('2003-02-17', null, 33213, 17, 4, 8),
        ('2005-12-01', null, 32213, 18, 5, 9),
        ('2002-03-10', null, 32213, 19, 5, 10),
        ('2007-11-26', null, 33213, 18, 5, 11),
        ('2003-02-17', null, 33213, 18, 5, 12),
        ('2003-02-18', null, 33213, 18, 5, 13),
        ('2003-02-17', null, 33213, 18, 5, 14),
        ('2005-11-05', '2019-11-05', 33213, 18, 5, 15);